Car/app/controllers/tokens_controller.rb

	def post

		connection = Faraday.new( :url => "https://qyapi.weixin.qq.com/" )
		response = connection.get("cgi-bin/gettoken?corpid=wx703900237aee25ec&corpsecret=FEuzM1J0hAUC_8Jck7MJpYmHbRmYXAMmoYX4siDBLx7H3_P1ybJaW2vmR8rcMVit", ).body

		token = JSON.parse(response)["access_token"]

		json = {
		:touser => "xuranci|luguangyao",
		:msgtype => "text",
		:agentid => "5",
		:text => {
			:content => "李四你好，请于" +  Time.now.to_formatted_s(:time).to_s + "到海洋大学临港校区接张三到人民广场,联系电话13800138000。确认请回复1，谢谢！"
			}
		}

		Infomation.create(
			:name => "张三",
			:phone => "13800138000",
			:start_time => Time.now,
			:start => "海洋大学临港校区",
			:end => "人民广场"
			)
---
INSERT INTO `infomations` (`created_at`, `driver`, `end`, `name`, `phone`, `start`, `start_time`, `updated_at`) VALUES ('2015-06-10 13:13:06', NULL, '‰∫∫Ê∞ëÂπøÂú∫', 'Âº†‰∏â', '13800138000', 'Êµ∑Ê¥ãÂ§ßÂ≠¶‰∏¥Ê∏ØÊ†°Âå∫', '2015-06-10 13:13:06', '2015-06-10 13:13:06')